In [3]:
%load_ext sql
%sql postgresql://appdev@data/appdev

'Connected: appdev@appdev'

# Grouping and more joins

## 1.

Using a single join and a grouping, write a query that allows you to find the forename, surname, driverid and the total number of wins for each driver in the f1db schema.

In [78]:

%%sql 
SELECT drivers.forename, drivers.surname, drivers.driverid, count(results.rank) as wins 
FROM drivers
JOIN results USING(driverid) 
WHERE results.rank = 1 
GROUP BY driverid;

31 rows affected.

[('Daniil', 'Kvyat', 826, 1),
 ('Daniel', 'Ricciardo', 817, 9),
 ('Rubens', 'Barrichello', 22, 6),
 ('Jarno', 'Trulli', 15, 1),
 ('Sergio', 'Pérez', 815, 4),
 ('Heikki', 'Kovalainen', 5, 2),
 ('Nico', 'Hülkenberg', 807, 2),
 ('Fernando', 'Alonso', 4, 22),
 ('Timo', 'Glock', 10, 1),
 ('Valtteri', 'Bottas', 822, 1),
 ('Juan', 'Pablo Montoya', 31, 3),
 ('Kamui', 'Kobayashi', 155, 1),
 ('Felipe', 'Massa', 13, 15),
 ('Nick', 'Heidfeld', 2, 2),
 ('Vitaly', 'Petrov', 808, 1),
 ('Sebastian', 'Vettel', 20, 31),
 ('Lewis', 'Hamilton', 1, 38),
 ('Jenson', 'Button', 18, 8),
 ('Bruno', 'Senna', 811, 1),
 ('Kimi', 'Räikkönen', 8, 41),
 ('Max', 'Verstappen', 830, 1),
 ('Esteban', 'Gutiérrez', 821, 1),
 ('Robert', 'Kubica', 9, 1),
 ('Michael', 'Schumacher', 30, 21),
 ('Giancarlo', 'Fisichella', 21, 1),
 ('Nico', 'Rosberg', 3, 20),
 ('Mark', 'Webber', 17, 18),
 ('Pedro', 'de la Rosa', 37, 1),
 ('Adrian', 'Sutil', 16, 1),
 ('Romain', 'Grosjean', 154, 1),
 ('Ralf', 'Schumacher', 23, 1)]

## 2.

Write a query that joins the tables results, constructors and drivers to show the amount of times a driver has driven a car from a constructor. 

    Your table should have three fields: 
    * drivers.driverref, 
    * constructors.name, 
    * count(*) (showing the number of times the driver has driven the constructor).
    
   Query gives 2093 rows, so the result is limited to 10.

In [81]:
%%sql
SELECT drivers.driverref, constructors.name, count(*) from drivers
JOIN results USING(driverid)
JOIN constructors USING(constructorid) 
GROUP BY drivers.driverref, constructors.name 
ORDER BY count 
DESC 
LIMIT 10;

10 rows affected.

[('michael_schumacher', 'Ferrari', 181),
 ('coulthard', 'McLaren', 150),
 ('massa', 'Ferrari', 140),
 ('button', 'McLaren', 137),
 ('rosberg', 'Mercedes', 136),
 ('hakkinen', 'McLaren', 133),
 ('laffite', 'Ligier', 132),
 ('webber', 'Red Bull', 129),
 ('raikkonen', 'Ferrari', 126),
 ('vettel', 'Red Bull', 113)]

## 3.

Extend the query from 2 by removing all tuples from the result where the status is not "Finished".

The query gives 658 rows, so result is limited to 10.

In [93]:
%%sql
SELECT drivers.driverref, constructors.name, count(*) from drivers
JOIN results USING (driverid) 
JOIN constructors USING (constructorid) 
WHERE results.statusid = 1 
GROUP BY drivers.driverref, constructors.name
ORDER BY count 
DESC 
LIMIT 10;

10 rows affected.

[('michael_schumacher', 'Ferrari', 141),
 ('massa', 'Ferrari', 112),
 ('rosberg', 'Mercedes', 109),
 ('webber', 'Red Bull', 100),
 ('vettel', 'Red Bull', 97),
 ('raikkonen', 'Ferrari', 92),
 ('button', 'McLaren', 87),
 ('alonso', 'Ferrari', 87),
 ('coulthard', 'McLaren', 85),
 ('hamilton', 'Mercedes', 85)]

## 4.

Create a third (and new) query that finds the amount of milliseconds spent in pitstop (see the pitstops relation) by each unique combinations of driverid and raceid.

Query produces 2699 rows, result limited to 10.

In [106]:
%%sql
SELECT driverid, raceid, sum(milliseconds) as milisec
FROM pitstops 
GROUP BY driverid, raceid 
LIMIT 10;

10 rows affected.

[(815, 969, Decimal('22045')),
 (8, 942, Decimal('59281')),
 (20, 898, Decimal('24086')),
 (8, 913, Decimal('89060')),
 (807, 894, Decimal('47766')),
 (3, 878, Decimal('21346')),
 (807, 953, Decimal('52279')),
 (4, 855, Decimal('63197')),
 (8, 930, Decimal('44412')),
 (819, 876, Decimal('22692'))]

## 5.

Use the query for 4 as a join subquery in query 3 (see slides on "a query within a query") to find the total amount of pitstop time, for each result in query 3.

(make a view from query 4)

ps. I spend a really long time on this assignement and didnt manage to solve it :( 

So far query provides 658 rows, therefor limit set 10.

In [11]:
%%sql
SELECT drivers.driverref, constructors.name, count(*) from drivers
JOIN results USING (driverid) 
JOIN constructors USING (constructorid)
WHERE results.statusid = 1 
GROUP BY drivers.driverref, constructors.name
ORDER BY count 
DESC
LIMIT 10;

10 rows affected.

[('michael_schumacher', 'Ferrari', 141),
 ('massa', 'Ferrari', 112),
 ('rosberg', 'Mercedes', 109),
 ('webber', 'Red Bull', 100),
 ('vettel', 'Red Bull', 97),
 ('raikkonen', 'Ferrari', 92),
 ('button', 'McLaren', 87),
 ('alonso', 'Ferrari', 87),
 ('coulthard', 'McLaren', 85),
 ('hamilton', 'Mercedes', 85)]

## 6.

As a last thing we want to find the driver with the least pistop time. However we want to control for the amount of races (see explanation below), so we need to include one last column: the average pitstop time per race. Your table should be sorted based on the ascending values of that average pitstop time.

ps. Was also stuck with this assignement as it seemed close to the previous, but couldnt work out to get the average pit stop time :(

In [12]:
%%sql
SELECT drivers.driverref, constructors.name, count(*) from drivers

JOIN results USING (driverid) 
JOIN constructors USING (constructorid)
WHERE results.statusid = 1
GROUP BY drivers.driverref, constructors.name
ORDER BY count 
ASC
LIMIT 10;

10 rows affected.

[('wehrlein', 'Manor Marussia', 1),
 ('mairesse', 'Ferrari', 1),
 ('stommelen', 'Embassy Hill', 1),
 ('rossi', 'Manor Marussia', 1),
 ('ericsson', 'Caterham', 1),
 ('martini', 'Minardi', 1),
 ('ertl', 'Hesketh', 1),
 ('faulkner', 'Kurtis Kraft', 1),
 ('veith', 'Kurtis Kraft', 1),
 ('bryan', 'Kurtis Kraft', 1)]

In [51]:
%%sql
select 
  tablename 
from 
  pg_tables  
where schemaname = 'f1db';

13 rows affected.

[('circuits',),
 ('constructorresults',),
 ('constructors',),
 ('constructorstandings',),
 ('drivers',),
 ('driverstandings',),
 ('laptimes',),
 ('pitstops',),
 ('qualifying',),
 ('races',),
 ('results',),
 ('seasons',),
 ('status',)]